Tekla.Structures.Dialog.DesignerWindowLocalization
Translation logic for translating strings.
Loads default localization file when instantiated

Tekla.Structures.Dialog.DesignerWindowLocalization.Instance
Instantiation

Tekla.Structures.Dialog.DesignerWindowLocalization.Item(System.String)
Returns translated string